LaloAlvarez-e/ALIENTEK-STM32F767-/STM32F767_DriverLib/xDriver_MCU/Core/NVIC/Peripheral/Register/xHeader/NVIC_RegisterPeripheral.h
/**
 *
 * @file NVIC_RegisterPeripheral.h
 * @copyright
 * @verbatim InDeviceMex 2020 @endverbatim
 *
 * @par Responsibility
 * @verbatim InDeviceMex Developers @endverbatim
 *
 * @version
 * @verbatim 1.0 @endverbatim
 *
 * @date
 * @verbatim 21 jun. 2020 @endverbatim
 *
 * @author
 * @verbatim vyldram @endverbatim
 *
 * @par Change History
 * @verbatim
 * Date           Author     Version     Description
 * 21 jun. 2020     vyldram    1.0         initial Version@endverbatim
 */

#ifndef XDRIVER_MCU_DRIVER_HEADER_NVIC_NVIC_PERIPHERAL_NVIC_REGISTER_NVIC_REGISTERPERIPHERAL_H_
#define XDRIVER_MCU_DRIVER_HEADER_NVIC_NVIC_PERIPHERAL_NVIC_REGISTER_NVIC_REGISTERPERIPHERAL_H_

#include <xDriver_MCU/Core/NVIC/Peripheral/xHeader/NVIC_Enum.h>
#include <xDriver_MCU/Core/NVIC/Peripheral/Struct/xHeader/NVIC_StructPeripheral.h>
#include <xDriver_MCU/Core/NVIC/Peripheral/Register/xHeader/NVIC_RegisterAddress.h>

#define NVIC    ((NVIC_t*) (NVIC_BASE + NVIC_OFFSET))   /*!< NVIC configuration struct          */
#define NVICw    ((NVICw_t*) (NVIC_BASE + NVIC_OFFSET))   /*!< NVIC configuration struct          */
#define NVICb    ((NVICb_t*) (NVIC_BASE + NVIC_OFFSET))   /*!< NVIC configuration struct          */

/********************************************************************************************/
/************************************* ISER0 ***********************************************/
/********************************************************************************************/
#define NVIC_ISER0    (((NVIC0_t*) (NVIC_BASE + NVIC_ISER0_OFFSET)))
#define NVIC_ISER0_R    (*((volatile UBase_t*) (NVIC_BASE + NVIC_ISER0_OFFSET)))

/********************************************************************************************/
/************************************* ICER0 ***********************************************/
/********************************************************************************************/
#define NVIC_ICER0    (((NVIC0_t*) (NVIC_BASE + NVIC_ICER0_OFFSET)))
#define NVIC_ICER0_R    (*((volatile UBase_t*) (NVIC_BASE + NVIC_ICER0_OFFSET)))

/********************************************************************************************/
/************************************* ISPR0 ***********************************************/
/********************************************************************************************/
#define NVIC_ISPR0    (((NVIC0_t*) (NVIC_BASE + NVIC_ISPR0_OFFSET)))
#define NVIC_ISPR0_R    (*((volatile UBase_t*) (NVIC_BASE + NVIC_ISPR0_OFFSET)))

/********************************************************************************************/
/************************************* ICPR0 ***********************************************/
/********************************************************************************************/
#define NVIC_ICPR0    (((NVIC0_t*) (NVIC_BASE + NVIC_ICPR0_OFFSET)))
#define NVIC_ICPR0_R    (*((volatile UBase_t*) (NVIC_BASE + NVIC_ICPR0_OFFSET)))

/********************************************************************************************/
/************************************* IABR0 ***********************************************/
/********************************************************************************************/
#define NVIC_IABR0    (((NVIC0_t*) (NVIC_BASE + NVIC_IABR0_OFFSET)))
#define NVIC_IABR0_R    (*((volatile UBase_t*) (NVIC_BASE + NVIC_IABR0_OFFSET)))

/********************************************************************************************/
/************************************* ISER1 ***********************************************/
/********************************************************************************************/
#define NVIC_ISER1    (((NVIC1_t*) (NVIC_BASE + NVIC_ISER1_OFFSET)))
#define NVIC_ISER1_R    (*((volatile UBase_t*) (NVIC_BASE + NVIC_ISER1_OFFSET)))

/********************************************************************************************/
/************************************* ICER1 ***********************************************/
/********************************************************************************************/
#define NVIC_ICER1    (((NVIC1_t*) (NVIC_BASE + NVIC_ICER1_OFFSET)))
#define NVIC_ICER1_R    (*((volatile UBase_t*) (NVIC_BASE + NVIC_ICER1_OFFSET)))

/********************************************************************************************/
/************************************* ISPR1 ***********************************************/
/********************************************************************************************/
#define NVIC_ISPR1    (((NVIC1_t*) (NVIC_BASE + NVIC_ISPR1_OFFSET)))
#define NVIC_ISPR1_R    (*((volatile UBase_t*) (NVIC_BASE + NVIC_ISPR1_OFFSET)))

/********************************************************************************************/
/************************************* ICPR1 ***********************************************/
/********************************************************************************************/
#define NVIC_ICPR1    (((NVIC1_t*) (NVIC_BASE + NVIC_ICPR1_OFFSET)))
#define NVIC_ICPR1_R    (*((volatile UBase_t*) (NVIC_BASE + NVIC_ICPR1_OFFSET)))

/********************************************************************************************/
/************************************* IABR1 ***********************************************/
/********************************************************************************************/
#define NVIC_IABR1    (((NVIC1_t*) (NVIC_BASE + NVIC_IABR1_OFFSET)))
#define NVIC_IABR1_R    (*((volatile UBase_t*) (NVIC_BASE + NVIC_IABR1_OFFSET)))

/********************************************************************************************/
/************************************* ISER2 ***********************************************/
/********************************************************************************************/
#define NVIC_ISER2    (((NVIC2_t*) (NVIC_BASE + NVIC_ISER2_OFFSET)))
#define NVIC_ISER2_R    (*((volatile UBase_t*) (NVIC_BASE + NVIC_ISER2_OFFSET)))

/********************************************************************************************/
/************************************* ICER2 ***********************************************/
/********************************************************************************************/
#define NVIC_ICER2    (((NVIC2_t*) (NVIC_BASE + NVIC_ICER2_OFFSET)))
#define NVIC_ICER2_R    (*((volatile UBase_t*) (NVIC_BASE + NVIC_ICER2_OFFSET)))

