LaloAlvarez-e/ALIENTEK-STM32F767-/STM32F767_DriverLib/xDriver_MCU/Core/NVIC/Peripheral/Register/xHeader/NVIC_RegisterPeripheral.h
/********************************************************************************************/
/************************************* ISPR2 ***********************************************/
/********************************************************************************************/
#define NVIC_ISPR2    (((NVIC2_t*) (NVIC_BASE + NVIC_ISPR2_OFFSET)))
#define NVIC_ISPR2_R    (*((volatile UBase_t*) (NVIC_BASE + NVIC_ISPR2_OFFSET)))

/********************************************************************************************/
/************************************* ICPR2 ***********************************************/
/********************************************************************************************/
#define NVIC_ICPR2    (((NVIC2_t*) (NVIC_BASE + NVIC_ICPR2_OFFSET)))
#define NVIC_ICPR2_R    (*((volatile UBase_t*) (NVIC_BASE + NVIC_ICPR2_OFFSET)))

/********************************************************************************************/
/************************************* IABR2 ***********************************************/
/********************************************************************************************/
#define NVIC_IABR2    (((NVIC2_t*) (NVIC_BASE + NVIC_IABR2_OFFSET)))
#define NVIC_IABR2_R    (*((volatile UBase_t*) (NVIC_BASE + NVIC_IABR2_OFFSET)))

/********************************************************************************************/
/************************************* ISER3 ***********************************************/
/********************************************************************************************/
#define NVIC_ISER3    (((NVIC3_t*) (NVIC_BASE + NVIC_ISER3_OFFSET)))
#define NVIC_ISER3_R    (*((volatile UBase_t*) (NVIC_BASE + NVIC_ISER3_OFFSET)))

/********************************************************************************************/
/************************************* ICER3 ***********************************************/
/********************************************************************************************/
#define NVIC_ICER3    (((NVIC3_t*) (NVIC_BASE + NVIC_ICER3_OFFSET)))
#define NVIC_ICER3_R    (*((volatile UBase_t*) (NVIC_BASE + NVIC_ICER3_OFFSET)))

/********************************************************************************************/
/************************************* ISPR3 ***********************************************/
/********************************************************************************************/
#define NVIC_ISPR3    (((NVIC3_t*) (NVIC_BASE + NVIC_ISPR3_OFFSET)))
#define NVIC_ISPR3_R    (*((volatile UBase_t*) (NVIC_BASE + NVIC_ISPR3_OFFSET)))

/********************************************************************************************/
/************************************* ICPR3 ***********************************************/
/********************************************************************************************/
#define NVIC_ICPR3    (((NVIC3_t*) (NVIC_BASE + NVIC_ICPR3_OFFSET)))
#define NVIC_ICPR3_R    (*((volatile UBase_t*) (NVIC_BASE + NVIC_ICPR3_OFFSET)))

/********************************************************************************************/
/************************************* IABR3 ***********************************************/
/********************************************************************************************/
#define NVIC_IABR3    (((NVIC3_t*) (NVIC_BASE + NVIC_IABR3_OFFSET)))
#define NVIC_IABR3_R    (*((volatile UBase_t*) (NVIC_BASE + NVIC_IABR3_OFFSET)))

/********************************************************************************************/
/************************************* IPR ***********************************************/
/******************************************************************************************/
#define NVIC_IPRb    (((IPRb__t*) (NVIC_BASE + NVIC_IPR0_OFFSET)))
#define NVIC_IPRw    (((IPRw__t*) (NVIC_BASE + NVIC_IPR0_OFFSET)))

/********************************************************************************************/
/************************************* IPR0 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR0    (((IPR0_t*) (NVIC_BASE + NVIC_IPR0_OFFSET)))
#define NVIC_IPR0_R    (*((volatile UBase_t*) (NVIC_BASE + NVIC_IPR0_OFFSET)))

/********************************************************************************************/
/************************************* IPR1 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR1    (((IPR1_t*) (NVIC_BASE + NVIC_IPR1_OFFSET)))
#define NVIC_IPR1_R    (*((volatile UBase_t*) (NVIC_BASE + NVIC_IPR1_OFFSET)))

/********************************************************************************************/
/************************************* IPR2 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR2    (((IPR2_t*) (NVIC_BASE + NVIC_IPR2_OFFSET)))
#define NVIC_IPR2_R    (*((volatile UBase_t*) (NVIC_BASE + NVIC_IPR2_OFFSET)))

/********************************************************************************************/
/************************************* IPR3 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR3    (((IPR3_t*) (NVIC_BASE + NVIC_IPR3_OFFSET)))
#define NVIC_IPR3_R    (*((volatile UBase_t*) (NVIC_BASE + NVIC_IPR3_OFFSET)))

/********************************************************************************************/
/************************************* IPR4 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR4    (((IPR4_t*) (NVIC_BASE + NVIC_IPR4_OFFSET)))
#define NVIC_IPR4_R    (*((volatile UBase_t*) (NVIC_BASE + NVIC_IPR4_OFFSET)))

