LaloAlvarez-e/ALIENTEK-STM32F767-/STM32F767_DriverLib/xDriver_MCU/Core/NVIC/Peripheral/Register/xHeader/NVIC_RegisterPeripheral.h
/********************************************************************************************/
/************************************* IPR5 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR5    (((IPR5_t*) (NVIC_BASE + NVIC_IPR5_OFFSET)))
#define NVIC_IPR5_R    (*((volatile UBase_t*) (NVIC_BASE + NVIC_IPR5_OFFSET)))

/********************************************************************************************/
/************************************* IPR6 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR6    (((IPR6_t*) (NVIC_BASE + NVIC_IPR6_OFFSET)))
#define NVIC_IPR6_R    (*((volatile UBase_t*) (NVIC_BASE + NVIC_IPR6_OFFSET)))

/********************************************************************************************/
/************************************* IPR7 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR7    (((IPR7_t*) (NVIC_BASE + NVIC_IPR7_OFFSET)))
#define NVIC_IPR7_R    (*((volatile UBase_t*) (NVIC_BASE + NVIC_IPR7_OFFSET)))

/********************************************************************************************/
/************************************* IPR8 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR8    (((IPR8_t*) (NVIC_BASE + NVIC_IPR8_OFFSET)))
#define NVIC_IPR8_R    (*((volatile UBase_t*) (NVIC_BASE + NVIC_IPR8_OFFSET)))

/********************************************************************************************/
/************************************* IPR9 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR9    (((IPR9_t*) (NVIC_BASE + NVIC_IPR9_OFFSET)))
#define NVIC_IPR9_R    (*((volatile UBase_t*) (NVIC_BASE + NVIC_IPR9_OFFSET)))

/********************************************************************************************/
/************************************* IPR10 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR10    (((IPR10_t*) (NVIC_BASE + NVIC_IPR10_OFFSET)))
#define NVIC_IPR10_R    (*((volatile UBase_t*) (NVIC_BASE + NVIC_IPR10_OFFSET)))

/********************************************************************************************/
/************************************* IPR11 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR11    (((IPR11_t*) (NVIC_BASE + NVIC_IPR11_OFFSET)))
#define NVIC_IPR11_R    (*((volatile UBase_t*) (NVIC_BASE + NVIC_IPR11_OFFSET)))

/********************************************************************************************/
/************************************* IPR12 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR12    (((IPR12_t*) (NVIC_BASE + NVIC_IPR12_OFFSET)))
#define NVIC_IPR12_R    (*((volatile UBase_t*) (NVIC_BASE + NVIC_IPR12_OFFSET)))

/********************************************************************************************/
/************************************* IPR13 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR13    (((IPR13_t*) (NVIC_BASE + NVIC_IPR13_OFFSET)))
#define NVIC_IPR13_R    (*((volatile UBase_t*) (NVIC_BASE + NVIC_IPR13_OFFSET)))

/********************************************************************************************/
/************************************* IPR14 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR14    (((IPR14_t*) (NVIC_BASE + NVIC_IPR14_OFFSET)))
#define NVIC_IPR14_R    (*((volatile UBase_t*) (NVIC_BASE + NVIC_IPR14_OFFSET)))

/********************************************************************************************/
/************************************* IPR15 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR15    (((IPR15_t*) (NVIC_BASE + NVIC_IPR15_OFFSET)))
#define NVIC_IPR15_R    (*((volatile UBase_t*) (NVIC_BASE + NVIC_IPR15_OFFSET)))

/********************************************************************************************/
/************************************* IPR16 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR16    (((IPR16_t*) (NVIC_BASE + NVIC_IPR16_OFFSET)))
#define NVIC_IPR16_R    (*((volatile UBase_t*) (NVIC_BASE + NVIC_IPR16_OFFSET)))

/********************************************************************************************/
/************************************* IPR17 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR17    (((IPR17_t*) (NVIC_BASE + NVIC_IPR17_OFFSET)))
#define NVIC_IPR17_R    (*((volatile UBase_t*) (NVIC_BASE + NVIC_IPR17_OFFSET)))

/********************************************************************************************/
/************************************* IPR18 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR18    (((IPR18_t*) (NVIC_BASE + NVIC_IPR18_OFFSET)))
#define NVIC_IPR18_R    (*((volatile UBase_t*) (NVIC_BASE + NVIC_IPR18_OFFSET)))

